### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [95]:
# Dependencies and Setup
import pandas as pd

# Load the purchase data file
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [96]:
# Display the total number of players
players_total = purchase_data["SN"].nunique()
print("The total number of players is ",players_total)

The total number of players is  576

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

   Number of Unique Items Average Price Number of Purchases Total Revenue
0                     183         $3.05                 780     $2,379.77

In [3]:
#Purchasing Analysis
#Run basic calculations to obtain number of unique items, average price, etc.
#Create a summary data frame to hold the results
#Optional: give the displayed data cleaner formatting
#Display the summary data frame

In [97]:
#Unique Items
unique_total = purchase_data["Item ID"].nunique()
unique_total

183

In [98]:
#Average Price
average_price = purchase_data["Price"].mean()
average_price=("${:.2f}".format(average_price))
average_price

'$3.05'

In [99]:
#Number Of Purchases
purchase_total = purchase_data["Purchase ID"].count()
purchase_total

780

In [100]:
#Total Revenue
rev_total = purchase_data["Price"].sum()
rev_total =("${:.2f}".format(rev_total))
rev_total

'$2379.77'

In [8]:
#Make a Data Frame of the results

In [101]:
purchasing_chart = pd.DataFrame(
    {"Number of Unique Items": [unique_total],
     "Average Price": [average_price],
     "Number of Purchases": [purchase_total],
     "Total Revenue": [rev_total]
    })
purchasing_chart

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     183         $3.05                  780      $2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [102]:
# Number of Females
female_players = purchase_data.loc[purchase_data["Gender"] == "Female", :]
female_players.head()

unique_females = female_players["SN"].nunique()
unique_females

81

In [103]:
# Number of Other
other_players = purchase_data.loc[purchase_data["Gender"] == "Other / Non-Disclosed", :]
other_players.head()

unique_others = other_players["SN"].nunique()
unique_others

11

In [104]:
# Number Of Males
male_players = purchase_data.loc[purchase_data["Gender"] == "Male", :]
male_players.head()

unique_males = male_players["SN"].nunique()
unique_males

484

In [105]:
#To make the table I got the data for each gender then put it in a table

In [106]:
#Mens Data
mens_data=purchase_data
mens_data=mens_data.set_index("Gender")
mens_data=mens_data.loc["Male"]
##mens_data.head()

In [107]:
#Mens average price
men_average_price = mens_data["Price"].mean()
men_average_price=("${:.2f}".format(men_average_price))
men_average_price

'$3.02'

In [108]:
#Men Purchase Counts
men_gender_counts = mens_data["Purchase ID"].count()
men_gender_counts

652

In [109]:
#Men Total Purchase Value
men_rev_total = mens_data["Price"].sum()
men_rev_total2=men_rev_total
men_rev_total =("${:.2f}".format(men_rev_total))
men_rev_total

'$1967.64'

In [110]:
#Average Purchase Price Men
average_price2 = men_rev_total2 / unique_males 
average_price2 =("${:.2f}".format(average_price2))
average_price2

'$4.07'

In [111]:
#Female Data
female_data=purchase_data
female_data=female_data.set_index("Gender")
female_data=female_data.loc["Female"]
##female_data.head()

In [112]:
#Female average price
female_average_price = female_data["Price"].mean()
female_average_price=("${:.2f}".format(female_average_price))
female_average_price

'$3.20'

In [113]:
#Female Purchase Counts
female_gender_counts = female_data["Purchase ID"].count()
female_gender_counts

113

In [114]:
#Female Total Purchase Value
female_rev_total = female_data["Price"].sum()
female_rev_total2=female_rev_total
female_rev_total =("${:.2f}".format(female_rev_total))
female_rev_total

'$361.94'

In [115]:
#Average Purchase Price Female
average_price_female = female_rev_total2 / unique_females
average_price_female =("${:.2f}".format(average_price_female))
average_price_female

'$4.47'

In [116]:
#Other Data
other_data=purchase_data
other_data=other_data.set_index("Gender")
other_data=other_data.loc["Other / Non-Disclosed"]
##other_data.head()

In [117]:
#Other average price
other_average_price = other_data["Price"].mean()
other_average_price=("${:.2f}".format(other_average_price))
other_average_price

'$3.35'

In [118]:
#other Purchase Counts
other_gender_counts = other_data["Purchase ID"].count()
other_gender_counts

15

In [119]:
#OHTER Purchase Value
other_rev_total = other_data["Price"].sum()
other_rev_total2=other_rev_total
other_rev_total =("${:.2f}".format(other_rev_total))
other_rev_total

'$50.19'

In [120]:
#Average Purchase Price other
average_price_other = other_rev_total2 / unique_others
average_price_other =("${:.2f}".format(average_price_other))
average_price_other

'$4.56'

In [121]:
gender_analysis_chart = pd.DataFrame(
    {"Purchase Count": [female_gender_counts, men_gender_counts, other_gender_counts],
     "Average Purchase Price": [average_price_female,average_price2,average_price_other],
     "Total Purchase Value": [female_rev_total, men_rev_total, other_rev_total],
     "Average Total Purchase per Person" :[average_price_female, average_price2, average_price_other]},
    index=["Female","Male","Other/Non-Discolosed"])
gender_analysis_chart

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchase per Person
Female,113,$4.47,$361.94,$4.47
Male,652,$4.07,$1967.64,$4.07
Other/Non-Discolosed,15,$4.56,$50.19,$4.56

In [122]:
# Create DataFrame Chart 
percent_males = unique_males / players_total
percent_males = ("{:.2%}".format(percent_males))
percent_males

'84.03%'

In [123]:
percent_females = unique_females / players_total
percent_females =("{:.2%}".format(percent_females))
percent_females

'14.06%'

In [124]:
percent_other = unique_others / players_total
percent_other = ("{:.2%}".format(percent_other))
percent_other

'1.91%'

In [125]:
# Create DataFrame Chart 
percent_males = unique_males / players_total
percent_males = ("{:.2%}".format(percent_males))


percent_females = unique_females / players_total
percent_females =("{:.2%}".format(percent_females))

percent_other = unique_others / players_total
percent_other = ("{:.2%}".format(percent_other))
     


gender = pd.DataFrame(
    {"Total Count": [unique_males, unique_females, unique_others],
     "Percentage Of Players": [percent_males, percent_females, percent_other]},
    index=["Males","Females","Other/Non-Discolosed"]
    )

gender

                      Total Count Percentage Of Players
Males                         484                84.03%
Females                        81                14.06%
Other/Non-Discolosed           11                 1.91%

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

In [133]:
# Create the bins in which Data will be held
# Bins are <10, 10-14, 15-19, 20-24, 25-29, 30-34, 35-39, 40+. 

bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 100]

# Create the names for the 8 bins
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

# Create a dataframe with Gender, SN, Age
gender_df=purchase_data.loc[:, ["Gender", "SN", "Age"]]
gender_df.head()

gender_df["Age Ranges"] = pd.cut(gender_df["Age"], bins,labels=group_names)

gender_tot=gender_df["Age Ranges"].value_counts()
gender_per=round((gender_tot / players_total * 100), 2)

tot_play_df= pd.DataFrame({"Total Players": gender_tot, "Percent of Players":gender_per})
tot_play_df["Percent of Players"] = tot_play_df["Percent of Players"].map("{:.2f}%".format)
tot_play_df=tot_play_df.sort_index()
tot_play_df



#s = pd.cut(df['percentage'], bins=bins).value_counts()

       Total Players Percent of Players
<10               23              3.99%
10-14             28              4.86%
15-19            136             23.61%
20-24            365             63.37%
25-29            101             17.53%
30-34             73             12.67%
35-39             41              7.12%
40+               13              2.26%

In [ ]:
# Total Uniques
uniques = purchase_data.loc[purchase_data["Gender"] == "Male", :]
male_players.head()

unique_males = male_players["SN"].nunique()
unique_males

In [134]:
age_count = purchase_data["Age"]
##age_count

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

In [143]:

# Create the bins in which Data will be held
# Bins are <10, 10-14, 15-19, 20-24, 25-29, 30-34, 35-39, 40+. 

bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 100]

# Create the names for the 8 bins
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

# Create a dataframe based on age ranges
purchase_data["Age Ranges"]=pd.cut(purchase_data["Age"],bins, labels=group_names)
              
purchase_data_groupby=purchase_data.groupby(by='Age Ranges')
              
#Summary Data
age_purch_count=purchase_data_groupby["Price"].count()
age_purch_price =round(purchase_data_groupby["Price"].mean(), 2)
age_tot_pur=round(purchase_data_groupby["Price"].sum(), 2)
age_avg_person=round(age_tot_pur/age_purch_count ,2)
              
age_analysis=pd.DataFrame({"Purchase Count": age_purch_count, "Average Purchase Price":age_purch_price, "Total Purchase Price": age_tot_pur, "Average Per Person":age_avg_person})
age_analysis["Average Purchase Price"]=age_analysis["Average Purchase Price"].map("${:.2f}".format)
age_analysis["Total Purchase Price"] = age_analysis["Total Purchase Price"].map("${:.2f}".format)
age_analysis["Average Per Person"]=age_analysis["Average Per Person"].map("${:.2f}".format)
age_analysis=age_analysis.sort_index()
age_analysis

#Create Summary Data

,Purchase Count,Average Purchase Price,Total Purchase Price,Average Per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$3.35
10-14,28,$2.96,$82.78,$2.96
15-19,136,$3.04,$412.89,$3.04
20-24,365,$3.05,$1114.06,$3.05
25-29,101,$2.90,$293.00,$2.90
30-34,73,$2.93,$214.00,$2.93
35-39,41,$3.60,$147.67,$3.60
40+,13,$2.94,$38.24,$2.94

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [150]:
#For Top Spenders item, define the required items.

top_total_purchase= purchase_data.groupby(["SN"]).sum()["Price"]
top_avg_purchase= round(purchase_data.groupby(["SN"]).mean()["Price"], 2)
top_purchase_count= purchase_data.groupby(["SN"]).count()["Price"]


#Create The Summay
top_df =pd.DataFrame({"Total Purchase Value":top_total_purchase, "Average Purchase Price":top_avg_purchase, "Purchase Count":top_purchase_count})
top_df["Average Purchase Price"] = top_df["Average Purchase Price"].map("${:.2f}".format)
top_df.sort_values("Total Purchase Value", ascending=False).head(10)

              Total Purchase Value Average Purchase Price  Purchase Count
SN
Lisosia93                    18.96                  $3.79               5
Idastidru52                  15.45                  $3.86               4
Chamjask73                   13.83                  $4.61               3
Iral74                       13.62                  $3.40               4
Iskadarya95                  13.10                  $4.37               3
Ilarin91                     12.70                  $4.23               3
Ialallo29                    11.84                  $3.95               3
Tyidaim51                    11.83                  $3.94               3
Lassilsala30                 11.51                  $3.84               3
Chadolyla44                  11.46                  $3.82               3

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [152]:
#For most popular, define the items

popular_df=purchase_data.groupby(["Item ID", "Item Name"])
popular_count=popular_df["Price"].count()
popular_price=popular_df["Price"].mean()
popular_top=popular_df["Price"].sum()     
                                  
#Create the data table
popular_table=pd.DataFrame({"Purchase Count":popular_count, "Total Purchase Value":popular_top, "Item Price": popular_price})
popular_table["Item Price"] = popular_table["Item Price"].map("${:.2f}".format)
popular_table.sort_values("Purchase Count" , ascending=False).head()

,,Purchase Count,Total Purchase Value,Item Price
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,50.76,$4.23
145,Fiery Glass Crusader,9,41.22,$4.58
108,"Extraction, Quickblade Of Trembling Hands",9,31.77,$3.53
82,Nirvana,9,44.10,$4.90
19,"Pursuit, Cudgel of Necromancy",8,8.16,$1.02

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80

In [153]:
#Sets the sort 
popular_table.sort_values("Total Purchase Value", ascending=False).head()

,,Purchase Count,Total Purchase Value,Item Price
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,50.76,$4.23
82,Nirvana,9,44.10,$4.90
145,Fiery Glass Crusader,9,41.22,$4.58
92,Final Critic,8,39.04,$4.88
103,Singed Scalpel,8,34.80,$4.35